# IFCHybrid Import Options Dispose Method

Source: https://www.revitapidocs.com/2026/e83df8a8-05df-0d2c-a815-2a9f9c822b29.htm

---

| IFCHybrid Import Options Dispose Method |
| --- |

Releases all resources used by the IFCHybridImportOptions
**Namespace:** Autodesk.Revit.DB.IFC
**Assembly:** RevitAPIIFC (in RevitAPIIFC.dll) Version: 26\.0\.4\.0 (26\.0\.4\.0\) Syntax C\# VB C\+\+ F\#
```
public void Dispose()
```

```
Public Sub Dispose
```

```
public:
virtual void Dispose() sealed
```

```
abstract Dispose : unit -> unit
override Dispose : unit -> unit
```

#### Implements

IDisposable Dispose
See Also

#### Reference

IFCHybridImportOptions Class Autodesk.Revit.DB.IFC Namespace